#+TITLE: 子查询优化器分析示例
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2024-07-01 Mon>
#+STARTUP: overview num indent
#+OPTIONS: ^:nil
#+PROPERTY: header-args:sql :dbhost 127.0.0.1 :database employees :engine mysql :dbuser root :exports both


* subq01
- 标量子查询 [[file:subq01_scalar_exp.sql.json][exp_json]] | [[file:subq01_scalar_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      count(distinct emp_no) as emp_cnt
    from
      dept_emp a
    where
      a.emp_no < 10100
      and a.dept_no = (
        select
          d.dept_no
        from
          departments d
        where
          d.dept_name = 'Development');
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type  | possible_keys   | key       | key_len | ref   | rows | filtered | Extra                    |
  |----+-------------+-------+------------+-------+-----------------+-----------+---------+-------+------+----------+--------------------------|
  |  1 | PRIMARY     | a     | NULL       | range | PRIMARY,dept_no | dept_no   |      20 | NULL  |   32 |   100.00 | Using where; Using index |
  |  2 | SUBQUERY    | d     | NULL       | const | dept_name       | dept_name |     162 | const |    1 |   100.00 | Using index              |

* subq02
- 唯一性的 IN 子查询 [[file:subq02_unique_exp.sql.json][exp_json]] | [[file:subq02_unique_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      e.first_name, e.last_name
    from
      employees e
    where
      e.emp_no in (
        select
          a.emp_no
        from
           dept_manager a
        where
          a.dept_no = 'd001');
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type   | possible_keys   | key     | key_len | ref                | rows | filtered | Extra                    |
  |----+-------------+-------+------------+--------+-----------------+---------+---------+--------------------+------+----------+--------------------------|
  |  1 | SIMPLE      | a     | NULL       | ref    | PRIMARY,dept_no | dept_no |      16 | const              |    2 |   100.00 | Using where; Using index |
  |  1 | SIMPLE      | e     | NULL       | eq_ref | PRIMARY         | PRIMARY |       4 | employees.a.emp_no |    1 |   100.00 | NULL                     |

* subq03
- 非唯一性的 IN 子查询 [[file:subq03_non-unique_exp.sql.json][exp_json]] | [[file:subq03_non-unique_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      ,*
    from
      departments d
    where
      d.dept_no in (
        select
          a.dept_no
        from
          dept_manager a
        where
          a.from_date >= '1995-01-01');
  #+END_SRC

  #+RESULTS:
  | id | select_type  | table       | partitions | type   | possible_keys       | key                 | key_len | ref                 | rows | filtered | Extra       |
  |----+--------------+-------------+------------+--------+---------------------+---------------------+---------+---------------------+------+----------+-------------|
  |  1 | SIMPLE       | d           | NULL       | index  | PRIMARY             | dept_name           |     162 | NULL                |    9 |   100.00 | Using index |
  |  1 | SIMPLE       | <subquery2> | NULL       | eq_ref | <auto_distinct_key> | <auto_distinct_key> |      16 | employees.d.dept_no |    1 |   100.00 | NULL        |
  |  2 | MATERIALIZED | a           | NULL       | ALL    | dept_no             | NULL                |    NULL | NULL                |   24 |    33.33 | Using where |

* subq04
- EXISTS 子查询 [[file:subq04_exists_exp.sql.json][exp_json]] | [[file:subq04_exists_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      e.first_name,
      e.last_name
    from
      employees e
    where
      exists (
        select
          ,*
        from
          dept_manager a
        where
          a.dept_no = 'd001'
          and a.emp_no = e.emp_no);
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type   | possible_keys   | key     | key_len | ref                | rows | filtered | Extra                    |
  |----+-------------+-------+------------+--------+-----------------+---------+---------+--------------------+------+----------+--------------------------|
  |  1 | SIMPLE      | a     | NULL       | ref    | PRIMARY,dept_no | dept_no |      16 | const              |    2 |   100.00 | Using where; Using index |
  |  1 | SIMPLE      | e     | NULL       | eq_ref | PRIMARY         | PRIMARY |       4 | employees.a.emp_no |    1 |   100.00 | NULL                     |

* subq05
- NOT IN 子查询 | [[file:subq05_not-in_exp.sql.json][exp_json]] | [[file:subq05_not-in_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      ,*
    from
      departments d
    where
      d.dept_no not in (
        select
          a.dept_no
        from
          dept_manager a
        where
          a.from_date > '1995-01-01');
  #+END_SRC

  #+RESULTS:
  | id | select_type  | table       | partitions | type   | possible_keys       | key                 | key_len | ref                 | rows | filtered | Extra                   |
  |----+--------------+-------------+------------+--------+---------------------+---------------------+---------+---------------------+------+----------+-------------------------|
  |  1 | SIMPLE       | d           | NULL       | index  | NULL                | dept_name           |     162 | NULL                |    9 |   100.00 | Using index             |
  |  1 | SIMPLE       | <subquery2> | NULL       | eq_ref | <auto_distinct_key> | <auto_distinct_key> |      17 | employees.d.dept_no |    1 |   100.00 | Using where; Not exists |
  |  2 | MATERIALIZED | a           | NULL       | ALL    | dept_no             | NULL                |    NULL | NULL                |   24 |   100.00 | Using where             |

* subq06
- 派生表 | [[file:subq06_derived-table_exp.sql.json][exp_json]] | [[file:subq06_derived-table_opt.sql.json][opt_trace]]
  #+begin_src sql
    explain
    select
      ,*
    from
      titles t,
      (
        select
          ,*
        from
          employees
        where
          emp_no <= 10100) emp_100
    where
      t.emp_no = emp_100.emp_no
      and t.from_date > '2000-01-01';
  #+END_SRC

  #+RESULTS:
  | id | select_type | table     | partitions | type   | possible_keys | key     | key_len | ref                | rows | filtered | Extra       |
  |----+-------------+-----------+------------+--------+---------------+---------+---------+--------------------+------+----------+-------------|
  |  1 | SIMPLE      | t         | NULL       | range  | PRIMARY       | PRIMARY |       4 | NULL               |  151 |    33.33 | Using where |
  |  1 | SIMPLE      | employees | NULL       | eq_ref | PRIMARY       | PRIMARY |       4 | employees.t.emp_no |    1 |   100.00 | NULL        |

* subq10
** subq10 - Default
- 默认 [[file:subq10_sj_default_exp.sql.json][exp_json]] | [[file:subq10_sj_default_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      ,*
    from
      departments d
    where
      d.dept_no in (
        select
          a.dept_no
        from
          dept_manager a
        where
          a.from_date >= '1995-01-01');
  #+END_SRC

  #+RESULTS:
  | id | select_type  | table       | partitions | type   | possible_keys       | key                 | key_len | ref                 | rows | filtered | Extra       |
  |----+--------------+-------------+------------+--------+---------------------+---------------------+---------+---------------------+------+----------+-------------|
  |  1 | SIMPLE       | d           | NULL       | index  | PRIMARY             | dept_name           |     162 | NULL                |    9 |   100.00 | Using index |
  |  1 | SIMPLE       | <subquery2> | NULL       | eq_ref | <auto_distinct_key> | <auto_distinct_key> |      16 | employees.d.dept_no |    1 |   100.00 | NULL        |
  |  2 | MATERIALIZED | a           | NULL       | ALL    | dept_no             | NULL                |    NULL | NULL                |   24 |    33.33 | Using where |

** subq11 - DuplicateWeedout
- [[file:subq11_sj_duplicate-weedout_exp.sql.json][exp_json]] | [[file:subq11_sj_duplicate-weedout_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain

    select
      ,*
    from
      departments d
    where
      d.dept_no in (
        select
          /*+ SEMIJOIN(DUPSWEEDOUT) */
          a.dept_no
        from
          dept_manager a
        where
          a.from_date >= '1995-01-01');
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type   | possible_keys | key     | key_len | ref                 | rows | filtered | Extra                        |
  |----+-------------+-------+------------+--------+---------------+---------+---------+---------------------+------+----------+------------------------------|
  |  1 | SIMPLE      | a     | NULL       | ALL    | dept_no       | NULL    | NULL    | NULL                |   24 |    33.33 | Using where; Start temporary |
  |  1 | SIMPLE      | d     | NULL       | eq_ref | PRIMARY       | PRIMARY | 16      | employees.a.dept_no |    1 |   100.00 | End temporary                |

** subq12 - FirstMatch
- [[file:subq12_sj_first-match_exp.sql.json][exp_json]] | [[file:subq12_sj_first-match_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain

    select
      ,*
    from
      departments d
    where
      d.dept_no in (
        select
          /*+ SEMIJOIN(FIRSTMATCH) */
          a.dept_no
        from
          dept_manager a
        where
          a.from_date >= '1995-01-01');
  #+END_SRC

** subq13 - LooseScan
- [[file:subq13_sj_loose-scan_exp.sql.json][exp_json]] | [[file:subq13_sj_loose-scan_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain

    select
      ,*
    from
      departments d
    where
      d.dept_no in (
        select
          /*+ SEMIJOIN(LOOSESCAN) */
          a.dept_no
        from
          dept_manager a
        where
          a.from_date >= '1995-01-01');
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type   | possible_keys | key     | key_len | ref                 | rows | filtered | Extra                        |
  |----+-------------+-------+------------+--------+---------------+---------+---------+---------------------+------+----------+------------------------------|
  |  1 | SIMPLE      | a     | NULL       | ALL    | dept_no       | NULL    | NULL    | NULL                |   24 |    33.33 | Using where; Start temporary |
  |  1 | SIMPLE      | d     | NULL       | eq_ref | PRIMARY       | PRIMARY | 16      | employees.a.dept_no |    1 |   100.00 | End temporary                |

** subq14 - Materialize
- [[file:subq14_sj_materialization_exp.sql.json][exp_json]] | [[file:subq14_sj_materialization_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain

    select
      ,*
    from
      departments d
    where
      d.dept_no in (
        select
          /*+ SEMIJOIN(MATERIALIZATION) */
          a.dept_no
        from
          dept_manager a
        where
          a.from_date >= '1995-01-01');
  #+END_SRC

  #+RESULTS:
  | id | select_type  | table       | partitions | type   | possible_keys       | key                 | key_len | ref                 | rows | filtered | Extra       |
  |----+--------------+-------------+------------+--------+---------------------+---------------------+---------+---------------------+------+----------+-------------|
  |  1 | SIMPLE       | d           | NULL       | index  | PRIMARY             | dept_name           |     162 | NULL                |    9 |   100.00 | Using index |
  |  1 | SIMPLE       | <subquery2> | NULL       | eq_ref | <auto_distinct_key> | <auto_distinct_key> |      16 | employees.d.dept_no |    1 |   100.00 | NULL        |
  |  2 | MATERIALIZED | a           | NULL       | ALL    | dept_no             | NULL                |    NULL | NULL                |   24 |    33.33 | Using where |

* subq20
** subq20 - Default
- [[file:subq20_sj_default_exp.sql.json][exp_json]] | [[file:subq20_sj_default_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      ,*
    from
      employees e
    where
      e.emp_no in (
        select
          a.emp_no
        from
          dept_manager a
        where
          a.dept_no >= 'd003');
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type   | possible_keys   | key     | key_len | ref                | rows | filtered | Extra                               |
  |----+-------------+-------+------------+--------+-----------------+---------+---------+--------------------+------+----------+-------------------------------------|
  |  1 | SIMPLE      | a     | NULL       | index  | PRIMARY,dept_no | PRIMARY |      20 | NULL               |   24 |   100.00 | Using where; Using index; LooseScan |
  |  1 | SIMPLE      | e     | NULL       | eq_ref | PRIMARY         | PRIMARY |       4 | employees.a.emp_no |    1 |   100.00 | NULL                                |

** subq21 - DuplicateWeedout
- [[file:subq21_sj_duplicate-weedout_exp.sql.json][exp_json]] | [[file:subq21_sj_duplicate-weedout_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      ,*
    from
      employees e
    where
      e.emp_no in (
        select
          /*+ SEMIJOIN(DUPSWEEDOUT) */
          a.emp_no
        from
          dept_manager a
        where
          a.dept_no >= 'd003');
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type   | possible_keys   | key     | key_len | ref                | rows | filtered | Extra                                     |
  |----+-------------+-------+------------+--------+-----------------+---------+---------+--------------------+------+----------+-------------------------------------------|
  |  1 | SIMPLE      | a     | NULL       | range  | PRIMARY,dept_no | dept_no |      16 | NULL               |   20 |   100.00 | Using where; Using index; Start temporary |
  |  1 | SIMPLE      | e     | NULL       | eq_ref | PRIMARY         | PRIMARY |       4 | employees.a.emp_no |    1 |   100.00 | End temporary                             |

** subq22 - FirstMatch
- [[file:subq22_sj_first-match_exp.sql.json][exp_json]]
  #+BEGIN_SRC sql
    explain
    select
      ,*
    from
      employees e
    where
      e.emp_no in (
        select
          /*+ SEMIJOIN(FIRSTMATCH) */
          a.emp_no
        from
          dept_manager a
        where
          a.dept_no >= 'd003');
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type | possible_keys   | key     | key_len | ref                |   rows | filtered | Extra                                   |
  |----+-------------+-------+------------+------+-----------------+---------+---------+--------------------+--------+----------+-----------------------------------------|
  |  1 | SIMPLE      | e     | NULL       | ALL  | PRIMARY         | NULL    | NULL    | NULL               | 276023 |   100.00 | NULL                                    |
  |  1 | SIMPLE      | a     | NULL       | ref  | PRIMARY,dept_no | PRIMARY | 4       | employees.e.emp_no |      1 |    83.33 | Using where; Using index; FirstMatch(e) |

** subq23 - LooseScan
- [[file:subq23_sj_loose-scan_exp.sql.json][exp_json]] | [[file:subq23_sj_loose-scan_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      ,*
    from
      employees e
    where
      e.emp_no in (
        select
          /*+ SEMIJOIN(LOOSESCAN) */
          a.emp_no
        from
          dept_manager a
        where
          a.dept_no >= 'd003');
  #+END_SRC

  #+RESULTS:
  | id | select_type | table | partitions | type   | possible_keys   | key     | key_len | ref                | rows | filtered | Extra                               |
  |----+-------------+-------+------------+--------+-----------------+---------+---------+--------------------+------+----------+-------------------------------------|
  |  1 | SIMPLE      | a     | NULL       | index  | PRIMARY,dept_no | PRIMARY |      20 | NULL               |   24 |   100.00 | Using where; Using index; LooseScan |
  |  1 | SIMPLE      | e     | NULL       | eq_ref | PRIMARY         | PRIMARY |       4 | employees.a.emp_no |    1 |   100.00 | NULL                                |

** subq24 - Materialize
- [[file:subq24_sj_materialization_exp.sql.json][exp_json]] | [[file:subq24_sj_materialization_opt.sql.json][opt_trace]]
  #+BEGIN_SRC sql
    explain
    select
      ,*
    from
      employees e
    where
      e.emp_no in (
        select
          /*+ SEMIJOIN(MATERIALIZATION) */
          a.emp_no
        from
          dept_manager a
        where
          a.dept_no >= 'd003');
  #+END_SRC

  #+RESULTS:
  | id | select_type  | table       | partitions | type   | possible_keys   | key     | key_len | ref                | rows | filtered | Extra                    |
  |----+--------------+-------------+------------+--------+-----------------+---------+---------+--------------------+------+----------+--------------------------|
  |  1 | SIMPLE       | <subquery2> | NULL       | ALL    | NULL            | NULL    |    NULL | NULL               | NULL |   100.00 | NULL                     |
  |  1 | SIMPLE       | e           | NULL       | eq_ref | PRIMARY         | PRIMARY |       4 | <subquery2>.emp_no |    1 |   100.00 | NULL                     |
  |  2 | MATERIALIZED | a           | NULL       | range  | PRIMARY,dept_no | dept_no |      16 | NULL               |   20 |   100.00 | Using where; Using index |
